mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf16xn/mb9bf16xn.svd
    <!-- PERIPHERAL "BT2" -->
    <peripheral derivedFrom="BT0">
      <name>BT2</name>
      <baseAddress>0x40025080</baseAddress>
      <description>Base Timer 2</description>
      <version>A</version>
      <!-- INTERRUPT "BT2" -->
      <interrupt>
        <name>BT2</name>
        <value>41</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT3" -->
    <peripheral derivedFrom="BT0">
      <name>BT3</name>
      <baseAddress>0x400250C0</baseAddress>
      <description>Base Timer 3</description>
      <version>A</version>
      <!-- INTERRUPT "BT3" -->
      <interrupt>
        <name>BT3</name>
        <value>42</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT4" -->
    <peripheral derivedFrom="BT0">
      <name>BT4</name>
      <baseAddress>0x40025200</baseAddress>
      <description>Base Timer 4</description>
      <version>A</version>
      <!-- INTERRUPT "BT4" -->
      <interrupt>
        <name>BT4</name>
        <value>43</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT5" -->
    <peripheral derivedFrom="BT0">
      <name>BT5</name>
      <baseAddress>0x40025240</baseAddress>
      <description>Base Timer 5</description>
      <version>A</version>
      <!-- INTERRUPT "BT5" -->
      <interrupt>
        <name>BT5</name>
        <value>44</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT6" -->
    <peripheral derivedFrom="BT0">
      <name>BT6</name>
      <baseAddress>0x40025280</baseAddress>
      <description>Base Timer 6</description>
      <version>A</version>
      <!-- INTERRUPT "BT6" -->
      <interrupt>
        <name>BT6</name>
        <value>45</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT7" -->
    <peripheral derivedFrom="BT0">
      <name>BT7</name>
      <baseAddress>0x400252C0</baseAddress>
      <description>Base Timer 7</description>
      <version>A</version>
      <!-- INTERRUPT "BT7" -->
      <interrupt>
        <name>BT7</name>
        <value>46</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL03" -->
    <peripheral>
      <name>BTIOSEL03</name>
      <description> Base Timer I/O Select</description>
      <version>A</version>
      <groupName>BTIOSEL03</groupName>
      <baseAddress>0x40025100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x1</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL0123" -->
        <register>
          <name>BTSEL0123</name>
          <description>I/O Select Register [BHW]</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL23" -->
            <field>
              <name>SEL23</name>
              <description>I/O select bits for Ch.2/Ch.3</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL01" -->
            <field>
              <name>SEL01</name>
              <description>I/O select bits for Ch.0/Ch.1</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "BTIOSEL47" -->
    <peripheral>
      <name>BTIOSEL47</name>
      <description> Base Timer I/O Select</description>
      <version>A</version>
      <groupName>BTIOSEL47</groupName>
      <baseAddress>0x40025300</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x1</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSEL4567" -->
        <register>
          <name>BTSEL4567</name>
          <description>I/O Select Register [BHW]</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SEL67" -->
            <field>
              <name>SEL67</name>
              <description>I/O select bits for Ch.6/Ch.7</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEL45" -->
            <field>
              <name>SEL45</name>
              <description>I/O select bits for Ch.4/Ch.5</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "SBSSR" -->
    <peripheral>
      <name>SBSSR</name>
      <description>Software-based Simultaneous Startup Register</description>
      <version>A</version>
      <groupName>SBSSR</groupName>
      <baseAddress>0x40025F00</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0FC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "BTSSSR" -->
        <register>
          <name>BTSSSR</name>
          <description>Software-based Simultaneous Startup Register [BHW]</description>
          <addressOffset>0xFC</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSSR15" -->
            <field>
              <name>SSSR15</name>
              <description>Software-based simultaneous startup bit of Ch.15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR14" -->
            <field>
              <name>SSSR14</name>
              <description>Software-based simultaneous startup bit of Ch.14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR13" -->
            <field>
              <name>SSSR13</name>
              <description>Software-based simultaneous startup bit of Ch.13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR12" -->
            <field>
              <name>SSSR12</name>
              <description>Software-based simultaneous startup bit of Ch.12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR11" -->
            <field>
              <name>SSSR11</name>
              <description>Software-based simultaneous startup bit of Ch.11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR10" -->
            <field>
              <name>SSSR10</name>
              <description>Software-based simultaneous startup bit of Ch.10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR9" -->
            <field>
              <name>SSSR9</name>
              <description>Software-based simultaneous startup bit of Ch.9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR8" -->
            <field>
              <name>SSSR8</name>
              <description>Software-based simultaneous startup bit of Ch.8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR7" -->
            <field>
              <name>SSSR7</name>
              <description>Software-based simultaneous startup bit of Ch.7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR6" -->
            <field>
              <name>SSSR6</name>
              <description>Software-based simultaneous startup bit of Ch.6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR5" -->
            <field>
              <name>SSSR5</name>
              <description>Software-based simultaneous startup bit of Ch.5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR4" -->
            <field>
              <name>SSSR4</name>
              <description>Software-based simultaneous startup bit of Ch.4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR3" -->
            <field>
              <name>SSSR3</name>
              <description>Software-based simultaneous startup bit of Ch.3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR2" -->
            <field>
              <name>SSSR2</name>
              <description>Software-based simultaneous startup bit of Ch.2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR1" -->
            <field>
              <name>SSSR1</name>
              <description>Software-based simultaneous startup bit of Ch.1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SSSR0" -->
            <field>
              <name>SSSR0</name>
              <description>Software-based simultaneous startup bit of Ch.0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
